# FamilySeparationTestingError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..FamilySeparationTestingError Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Family separation testing error (internal).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilySeparationTestingError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilySeparationTestingError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilySeparationTestingError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace